In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame(
    {  
        "name":['tom','jack','alice','bob','allen'], #这里有逗号
        "age":[15,24,25,35,59], #这里有逗号
        'score':[60,85,86,90,46]
    },index=[1,2,3,4,5],columns=["name","age",'score']
)
df

    name  age  score
1    tom   15     60
2   jack   24     85
3  alice   25     86
4    bob   35     90
5  allen   59     46

In [7]:
#获取单列数据
print(df['name'])
print(type(df['name']))
print(df.name)
print(type(df.name))
print(df[['name']])
print(type(df[['name']])) #这里是dataframe,j既可以访问多列数据
#获取多列数据
print(df[['name','score']])

1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object
<class 'pandas.core.series.Series'>
1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object
<class 'pandas.core.series.Series'>
    name
1    tom
2   jack
3  alice
4    bob
5  allen
<class 'pandas.core.frame.DataFrame'>
    name  score
1    tom     60
2   jack     85
3  alice     86
4    bob     90
5  allen     46

In [8]:
#查看某前（后）行
print(df.head(2))
print(df.tail(3))

   name  age  score
1   tom   15     60
2  jack   24     85
    name  age  score
3  alice   25     86
4    bob   35     90
5  allen   59     46

In [14]:
#使用布尔索引筛选数据
df[df.score>80]
#df[(df.score>80)&(df.age>30)] 多条件

    name  age  score
2   jack   24     85
3  alice   25     86
4    bob   35     90

In [15]:
#随机抽样
df.sample(3)

    name  age  score
4    bob   35     90
1    tom   15     60
5  allen   59     46